
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//При выборе статуса «Отклонён курьером» или «Отклонён клиентом» 
	//система должна требовать заполнить комментарий   
	//проверяемые реквизиты - массив - у меня это реквизит Статус и Комментарий
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	//если Статус не отклонен то дабавим в массив непроверяемых реквизитов остальыне статусы и комментарий
	Если Статус = Перечисления.СтатусыДоставок.ВзятВРаботу 
		или Статус = Перечисления.СтатусыДоставок.Выполнен
		или Статус = Перечисления.СтатусыДоставок.Запланирован Тогда  
		НепроверяемыеРеквизиты.Добавить("ВзятВРаботу");
		НепроверяемыеРеквизиты.Добавить("Выполнен");
		НепроверяемыеРеквизиты.Добавить("Запланирован");
		НепроверяемыеРеквизиты.Добавить("Комментарий");
		
		//если статус Отклонен то проверим заполненность поля Комментарий
	ИначеЕсли Не ЗначениеЗаполнено(Комментарий) Тогда
		
		ИндексКомментарий = ПроверяемыеРеквизиты.Найти("Комментарий");
		
		// Если он не заполнен, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните поле комментарий";
		Сообщение.Поле = "Комментарий";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		
		Сообщение.Сообщить();
		
		// Сообщим платформе, что мы сами обработали проверку заполнения реквизита "Комментарий"
		ПроверяемыеРеквизиты.Удалить(ИндексКомментарий);
		
		// Так как информация не консистентна, то продолжать работу дальше смысла нет
		
		Отказ = Истина;
		
	КонецЕсли;

	//вызвать процедуру для удаления непроверяемых реквизитов
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);  
	
КонецПроцедуры;

#Если МобильноеПриложениеКлиент Тогда
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// реализовать регистрацию документов «Доставка» при записи
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = " ВЫБРАТЬ
	                |	ОбменСМобильнымПриложением.Ссылка КАК Ссылка
	                |ИЗ
	                |	ПланОбмена.ОбменСМобильнымПриложением КАК ОбменСМобильнымПриложением
	                |ГДЕ
	                |	НЕ ОбменСМобильнымПриложением.ПометкаУдаления"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	
КонецПроцедуры
#КонецЕсли   

