
&НаКлиенте
Процедура Местоположение(Команда)
	#Если МобильноеПриложениеКлиент Тогда 
		//Провайдеры = СредстваГеопозиционирования.ПолучитьПровайдеров();
		//НайденныйПровайдер = СредстваГеопозиционирования.ПолучитьСамогоТочногоПровайдера(); 
		//НайденныйПровайдер = СредстваГеопозиционирования.ПолучитьСамогоЭнергоЭкономичногоПровайдера();
		
		//Если СредстваГеопозиционирования.ОбновитьМестоположение(НайденныйПровайдер.Имя, 30) Тогда
			МестоположенияТП = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение("network");
			ДанныеАдресаТП = ПолучитьАдресПоМестоположению(МестоположенияТП.Координаты);
			
			Если ДанныеАдресаТП <> Неопределено Тогда
				
				Строка_ = Объект.КоординатыТП.Добавить();
				Строка_.Адрес = "Страна " + ДанныеАдресаТП.Страна;
				
				Строка_ = Объект.КоординатыТП.Добавить();
				Строка_.Адрес = "Город " + ДанныеАдресаТП.Город; 
				
				Строка_ = Объект.КоординатыТП.Добавить();
				Строка_.Адрес = "Улица " + ДанныеАдресаТП.Улица;  
				
				Строка_ = Объект.КоординатыТП.Добавить();
				Строка_.Адрес = "Дом " + ДанныеАдресаТП.Дом;  
				
				Строка_ = Объект.КоординатыТП.Добавить();
				Строка_.Адрес = "Широта " + МестоположенияТП.Координаты.Широта;   
				
				Строка_ = Объект.КоординатыТП.Добавить();
				Строка_.Адрес = "Долгота " + МестоположенияТП.Координаты.Долгота;    
				
				Строка_ = Объект.КоординатыТП.Добавить();
				Строка_.Адрес = "Провайдер " + "network";
				
				ПоказатьНаКарте(МестоположенияТП.Координаты);
				
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Адрес не найден";
				Сообщение.Сообщить();
			КонецЕсли;
			
		//Иначе
			//Сообщение = Новый СообщениеПользователю;
			//Сообщение.Текст = "Провайдер геопозиционирования не найден";
			//Сообщение.Сообщить(); 
		//КонецЕсли;
				
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВсеПровайдеры(Команда)
	#Если МобильноеПриложениеКлиент Тогда   
		Провайдеры = СредстваГеопозиционирования.ПолучитьПровайдеров();
		Сообщить (Провайдеры.Количество());
		Для и1=0 По Провайдеры.Количество()-1 цикл
			Сообщить (Провайдеры[и1].Имя);
		КонецЦикла;
	#КонецЕсли
КонецПроцедуры
